Tekla.Structures.DirectManipulation.Adapter.Picker.Native.IPickerHandlerImports
The Tekla.Structures.DirectManipulation.Adapter.Picker.Native.IPickerHandlerImports class interfaces all imported functions related to the picker handler.

Tekla.Structures.DirectManipulation.Adapter.Picker.Native.IPickerHandlerImports.InvokeObjectPick(Tekla.Structures.ModelInternal.dotUIPicker_t)
Invokes the picker.
picker: The arguments indicating the required picker configuration.
Returns: True on success; otherwise, false.

Tekla.Structures.DirectManipulation.Adapter.Picker.Native.IPickerHandlerImports.GetPickedObjects(Tekla.Structures.DirectManipulation.Adapter.Picker.Native.dotDMPickedObjects_t@)
Exports the get picker data command.
argument: The picker data.
Returns: Greater than 0 on success.

Tekla.Structures.DirectManipulation.Adapter.Picker.Native.IPickerHandlerImports.GetPickerCommand(Tekla.Structures.DirectManipulation.Adapter.Native.dotParameterData@)
Exports the function to get the name of the active picker command.
argument: The picker command name.
Returns: Greater than 0 on success.

Tekla.Structures.DirectManipulation.Adapter.Picker.Native.IPickerHandlerImports.GetToleratedPickedPoint(Tekla.Structures.DirectManipulation.Adapter.Interaction.Native.dotDMTolerationSnapPoint_t@)
Gets the current snapped point.
snapPoint: The snapped point.
Returns: Greater than 0 on success.

Tekla.Structures.DirectManipulation.Adapter.Picker.Native.IPickerHandlerImports.SetToleratedPickedPoint(Tekla.Structures.DirectManipulation.Adapter.Interaction.Native.dotDMTolerationSnapPoint_t)
Overrides the current snapped point and hit type.
snapPoint: The snapped point.
Returns: Greater than 0 on success.